In [40]:
import random

dict = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [41]:
import pandas as pd 
import numpy as np 
df = pd.DataFrame(dict)

In [42]:
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [43]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print("Summary of the basic information about this DataFrame and its data:")
print(df.info())

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [44]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [45]:
df2 = df[['name' ,'score']]

In [46]:
df2

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [47]:
df2['score'].apply(lambda row : row +2 )

a    14.5
b    11.0
c    18.5
d     NaN
e    11.0
f    22.0
g    16.5
h     NaN
i    10.0
j    21.0
Name: score, dtype: float64

In [51]:
df_mean = df.apply(lambda col: col.count() , axis=0)

In [52]:
df_mean

name        10
score        8
attempts    10
qualify     10
dtype: int64

In [54]:
df['score3'] = df.apply(lambda  row : row['score'] +3 , axis=1)
df

        name  score  attempts qualify  score3
a  Anastasia   12.5         1     yes    15.5
b       Dima    9.0         3      no    12.0
c  Katherine   16.5         2     yes    19.5
d      James    NaN         3      no     NaN
e      Emily    9.0         2      no    12.0
f    Michael   20.0         3     yes    23.0
g    Matthew   14.5         1     yes    17.5
h      Laura    NaN         1      no     NaN
i      Kevin    8.0         2      no    11.0
j      Jonas   19.0         1     yes    22.0

In [55]:
df

        name  score  attempts qualify  score3
a  Anastasia   12.5         1     yes    15.5
b       Dima    9.0         3      no    12.0
c  Katherine   16.5         2     yes    19.5
d      James    NaN         3      no     NaN
e      Emily    9.0         2      no    12.0
f    Michael   20.0         3     yes    23.0
g    Matthew   14.5         1     yes    17.5
h      Laura    NaN         1      no     NaN
i      Kevin    8.0         2      no    11.0
j      Jonas   19.0         1     yes    22.0

In [60]:
df[(df['attempts'] <2) & (df['score'] > 15)]

    name  score  attempts qualify  score3
j  Jonas   19.0         1     yes    22.0

In [63]:
df.loc['d' , 'score'] = 11.5

In [64]:
df['attempts'].sum()

19

In [67]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df['score'].mean()

13.5625

In [73]:
df.loc['k'] = [13 , 'jv', 1 , 'yes']

C:\Users\dalil\AppData\Local\Temp\ipykernel_2620\1863038398.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'jv' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc['k'] = [13 , 'jv', 1 , 'yes']

In [74]:
df

        name score  attempts qualify
a  Anastasia  12.5         1     yes
b       Dima   9.0         3      no
c  Katherine  16.5         2     yes
d      James   NaN         3      no
e      Emily   9.0         2      no
f    Michael  20.0         3     yes
g    Matthew  14.5         1     yes
h      Laura   NaN         1      no
i      Kevin   8.0         2      no
j      Jonas  19.0         1     yes
k         13    jv         1     yes

In [76]:
df.drop('k')

        name score  attempts qualify
a  Anastasia  12.5         1     yes
b       Dima   9.0         3      no
c  Katherine  16.5         2     yes
d      James   NaN         3      no
e      Emily   9.0         2      no
f    Michael  20.0         3     yes
g    Matthew  14.5         1     yes
h      Laura   NaN         1      no
i      Kevin   8.0         2      no
j      Jonas  19.0         1     yes

In [77]:
df

        name score  attempts qualify
a  Anastasia  12.5         1     yes
b       Dima   9.0         3      no
c  Katherine  16.5         2     yes
d      James   NaN         3      no
e      Emily   9.0         2      no
f    Michael  20.0         3     yes
g    Matthew  14.5         1     yes
h      Laura   NaN         1      no
i      Kevin   8.0         2      no
j      Jonas  19.0         1     yes
k         13    jv         1     yes

In [80]:
df['qualify'] = df['qualify'].apply(lambda value : True if value == 'yes'  else False )

In [81]:
df

        name score  attempts  qualify
a  Anastasia  12.5         1     True
b       Dima   9.0         3    False
c  Katherine  16.5         2     True
d      James   NaN         3    False
e      Emily   9.0         2    False
f    Michael  20.0         3     True
g    Matthew  14.5         1     True
h      Laura   NaN         1    False
i      Kevin   8.0         2    False
j      Jonas  19.0         1     True
k         13    jv         1     True

In [82]:
df.dtypes

name        object
score       object
attempts     int64
qualify       bool
dtype: object

In [84]:
df.sort_values(by = ['name' ,'score']  , ascending  = [True , False] ,

        name score  attempts  qualify
k         13    jv         1     True
a  Anastasia  12.5         1     True
b       Dima   9.0         3    False
e      Emily   9.0         2    False
d      James   NaN         3    False
j      Jonas  19.0         1     True
c  Katherine  16.5         2     True
i      Kevin   8.0         2    False
h      Laura   NaN         1    False
g    Matthew  14.5         1     True
f    Michael  20.0         3     True

In [91]:
df.drop(columns=['attempts'])

        name score  qualify
a  Anastasia  12.5     True
b       Dima   9.0    False
c  Katherine  16.5     True
d      James   NaN    False
e      Emily   9.0    False
f    Michael  20.0     True
g    Matthew  14.5     True
h      Laura   NaN    False
i      Kevin   8.0    False
j      Jonas  19.0     True
k         13    jv     True

In [92]:
df

        name score  attempts  qualify
a  Anastasia  12.5         1     True
b       Dima   9.0         3    False
c  Katherine  16.5         2     True
d      James   NaN         3    False
e      Emily   9.0         2    False
f    Michael  20.0         3     True
g    Matthew  14.5         1     True
h      Laura   NaN         1    False
i      Kevin   8.0         2    False
j      Jonas  19.0         1     True
k         13    jv         1     True

In [97]:
import random 

df['score'] = df['score'].apply(lambda x : random.randint( 1 , 2000))

In [98]:
df['score']

a      29
b     879
c     513
d    1006
e    1996
f    1946
g    1786
h      78
i      82
j    1566
k    1156
Name: score, dtype: int64